import lang from './lang';

const messages = {
  lang,
  about: {
    header: '台復會的文化',
    content: [
      '服務別人、肯定自己',
      'Sharing is learning, giving is receiving.',
      '台復新創會整合大家的資源，協助產業建立生態系統，鼓勵新創事業發展台灣新價值，推動新創產業成為台灣另一群護國神山！',
    ],
  },
  origin: {
    header: '緣起',
    content: [
      '台復新創學會的創立，是緣起於2016年6月臺大EMBA的爐邊會，談起如何運用學長姐寶貴的資源，帶動新創產業發展，當時參與的人包括廖永源創會理事長、陳家聲教授、鄧傳馨學長、陳建中學長、陳晉君學姐、謝文倩學姐、王克萍學長、戴念國學長、楊桂康學長及韋月桂學姐，在大家的共同理想之下，由創會理事長廖永源、陳家聲教授和學長姐們積極推動，在科技部陳良基部長大力支持下，開始台復會的運作，2017年12月13日舉辦成立大會，台大郭大維代理校長連續3年出席台復會的會員大會，支持台復會的發展。',
      '台復會是一個開放給所有臺大及上海復旦大學師生的平台與社團，以臺大及上海復旦的教授、校友、在校生為主要成員，聚焦於創新、創意、創業平台，廣邀優秀校友、教授及產官學界參與，得到來自各方的大力支持，包括科技部陳良基部長，郭大維校長，國發會龔明鑫主委，各駐台代表，郭瑞祥教授，謝明慧院長，胡星陽院長，劉啟群副院長等，以及各位理監事出錢出力，學長姐熱情參與，無私分享，鏈結多樣化資源，創造資源整合的巨大綜效。',
    ],
  },
  purposr: {
    header: '宗旨',
    content: {
      description: [
        '台復新創學會以研究、發展、分享及推廣新創構想、平臺、産品及新的商業模式，進而提昇臺灣產業，創造臺灣產業價值；並以分享資源，發掘資源，整合資源，共用資源，跨行、跨業、跨界提高綜合效益之研究為宗旨。',
        '為進一步提供新創事業更多的選擇，更大的市場，更高的估值，更多的資金，台復新創學會整合國際新創資源，帶領新創團隊拜訪駐台外館，讓他們更進一步瞭解台灣優秀的新創團隊，協助新創事業開拓國際市場，從臺灣出發，放眼國際，與世界市場鏈接。',
      ],
      activity: {
        header: '主要活動內容包括：',
        content: [
          '經常性舉辦新創發表會，邀請各領域專家或會員進行新創商業模式分享',
          '實地參訪國內外企業，實際體驗，對新創商業模式進行實務交流',
          '不定期舉辦國際交流，整合國際新創資源，提供新創事業更多選擇',
          '各行業專業深度圓桌論壇',
        ],
      },
    },
  },
  history: {
    header: '創會會長｜廖永源',
    content: [
      '新創事業要能持續發展，資源的挹注是非常重要的因素，本人與志同道合的學長姐共同推動，籌設台復新創學會，從籌備成立到卸任交棒，歷經五年半的經營，台復會整合臺大多樣化的學程資源，打造新創一條龍，已逐漸形成一個強大的資源整合平台。今後將持續協助新創事業開拓國際市場，從臺灣出發，放眼國際，站上世界舞台。',
    ],
  },
  footer: {
    email: '電子信箱',
  },
};

export default messages;
